In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('../sample/01_ADS_Sample_1.csv')
df1.head(3)

  YEAR_MONTH  SOCIAL     TV  NEWSPAPER  SALES_AMT
0   2005-Dec   84.72  19.20      48.96      14.28
1   2006-Jan  351.48  33.96      51.84      11.52
2   2006-Feb  135.48  20.88      46.32      20.88

In [3]:
df1.columns.to_list()

['YEAR_MONTH', 'SOCIAL', 'TV', 'NEWSPAPER', 'SALES_AMT']

In [4]:
feature=['SOCIAL', 'TV', 'NEWSPAPER', 'SALES_AMT']

In [9]:
result = df1[feature].corr().drop('SALES_AMT')['SALES_AMT']
result

SOCIAL       0.037020
TV          -0.183192
NEWSPAPER    0.002282
Name: SALES_AMT, dtype: float64

In [10]:
top = result.abs().idxmax()

'TV'

In [11]:
result['TV']

-0.1831919052011432

In [13]:
round(result['TV'], 3)

-0.183

In [14]:
# 답 : -0.183

In [15]:
df1.dtypes

YEAR_MONTH     object
SOCIAL        float64
TV            float64
NEWSPAPER     float64
SALES_AMT     float64
dtype: object

In [16]:
df2 = df1.copy()

In [22]:
df2['year'] = df2['YEAR_MONTH'].str.split('-').str[0]
df2.head(3)

  YEAR_MONTH  SOCIAL     TV  NEWSPAPER  SALES_AMT  year
0   2005-Dec   84.72  19.20      48.96      14.28  2005
1   2006-Jan  351.48  33.96      51.84      11.52  2006
2   2006-Feb  135.48  20.88      46.32      20.88  2006

In [27]:
df_2009 = df2[df2['year'] == '2009']
df_2019 = df2[df2['year'] == '2019']

In [29]:
sale_2009 = df_2009['SALES_AMT'].sum()
sale_2019 = df_2019['SALES_AMT'].sum()

In [31]:
ratio = ((sale_2019 - sale_2009) / sale_2009) * 100
ratio

0.19379844961241044

In [32]:
round(ratio, 3)

0.194

In [33]:
# 답 : 0.194

In [35]:
mean_2009 = df_2009['SALES_AMT']
mean_2019 = df_2019['SALES_AMT']

In [36]:
from scipy.stats import ttest_ind

In [39]:
result = ttest_ind(mean_2009, mean_2019)
result

Ttest_indResult(statistic=-0.011021647568416792, pvalue=0.9913055138582367)

In [41]:
round(result.pvalue, 3)

0.991

In [42]:
# 답 : 0.991